/*
*********************************************************************************************************
*
*	模块名称 : http_iap 
*	文件名称 : http_iap.h
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*						版本号    日期        作者       说明
*						V1.0  2019年04月15日  suozhang   首次发布
*
*********************************************************************************************************
*/

#ifndef  __HTTP_IAP_H__
#define  __HTTP_IAP_H__

#include "lwip/opt.h"
	
void http_iap_task(void *pvParameters);

#endif
